Repository: Bachar-official/profile
Catalog: lib/l10n/app_*.arb
Languages: ru

# code
source: en
ru: ru

# author
source: Ivan Bacharnikov
ru: Иван Бачарников

# position
source: Frontend/Flutter developer
ru: Frontend/Flutter разработчик

source: Age
ru: Возраст

source: City
ru: Город

# anotherLanguage
source: Переключиться на русский
ru: Switch to English

source: Light theme
ru: Светлая тема

source: Dark theme
ru: Тёмная тема

source: Experience
ru: Опыт работы

source: Education
ru: Образование

source: Languages
ru: Языки

source: Hobbies
ru: Хобби

# cources
source: Courses
ru: Курсы

source: Hard skills
ru: Навыки

# currentCity
source: Orenburg, Russia
ru: Оренбург, Россия

source: until now
ru: по настоящее время

# exp0
source: Cinimex:Frontend Developer:Frontend development in various design systems for the banking sector:2019-10-01
ru: Cinimex:Фронтенд разработчик:Разработка фронтенда в различных дизайн-системах для банковского сектора:2019-10-01

# exp1
source: Orenburg State University:Senior Lecturer:Taught the disciplines "Development of mobile applications (Flutter)" and "Development of client web applications (React)":2023-09-01:2023-12-01
ru: Оренбургский государственный университет:Старший преподаватель:Преподавал дисциплины "Разработка мобильных приложений (Flutter)" и "Разработка клиентских веб-приложений (React)":2023-09-01:2023-12-01

# ed0
source: Orenburg College of Statistics, Economics and Informatics:Technician:Computers, complexes, systems and networks:2013-07-01
ru: Оренбургский колледж статистики, экономики и информатики:Техник:Вычислительные машины, комплексы, системы и сети:2013-07-01

# ed1
source: Orenburg State University:Bachelor:Informatics and Computer Science:2019-07-01
ru: Оренбургский государственный университет:Бакалавр:Информатика и вычислительная техника:2019-07-01

# lg0
source: Russian:ru:Native
ru: Русский:ru:Родной

# lg1
source: English:en:B1 (Intermediate)
ru: Английский:en:B1 (Intermediate)

# lg2
source: Esperanto:eo:A1 (Beginner)
ru: Эсператно:eo:A1 (Beginner)

# allHobbies
source: Radio amateur,Cyclist,Photographer,YouTuber,Quadcopter pilot
ru: Радиолюбитель,Велосипедист,Фотограф,Ютубер,Пилот квадрокоптера

source: Collapse all
ru: Скрыть все

source: Expand all
ru: Развернуть все

# downloadContact
source: Download vCard
ru: Скачать vCard

source: Download CV
ru: Скачать резюме

source: Projects
ru: Проекты

# pr0
source: QSO Logger;https://github.com/Bachar-official/flutter_qso;Flutter app for or logging radio HAM QSO
ru: QSO Logger;https://github.com/Bachar-official/flutter_qso;Flutter приложение для ведения записей QSO.

# pr1
source: CASE (backend);https://github.com/Bachar-official/CASE-be;Backend Dart service for storing, updating and downloading apk files.
ru: CASE (backend);https://github.com/Bachar-official/CASE-be;Dart сервис для хранения, обновления и скачивания APK файлов.

# pr2
source: CASE (frontend/mobile app);https://github.com/Bachar-official/case_fe;Frontend/Mobile app, client for CASE backend.
ru: CASE (frontend/mobile app);https://github.com/Bachar-official/case_fe;Frontend/мобильное приложение, клиент для бэкенда CASE.

# pr3
source: CMD_BOT;https://github.com/Bachar-official/dart_cmd_bot;Telegram bot for remote maintenance of a work computer.
ru: CMD_BOT;https://github.com/Bachar-official/dart_cmd_bot;Telegram бот для удалённого обслуживания рабочего компьютера.

# crs1
source: Mobile development school [Flutter];Yandex;2024-08-01
ru: Школа мобильной разработки [Flutter];Яндекс;2024-08-01
